src/Google/AdsApi/Common/Testing/getCreativesByStatement-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="https://www.google.com/apis/ads/publisher/v201505">
<SOAP-ENV:Header>
  <ns1:RequestHeader>
    <ns1:networkCode id="hello googs" sing="and_dance">888888</ns1:networkCode>
    <ns1:clientCustomerId>123-777-999</ns1:clientCustomerId>
    <ns1:applicationName>google report downloader (DfpApi-PHP, googleads-php-lib2/1.0.0-alpha, PHP/5.5.20)</ns1:applicationName>
  </ns1:RequestHeader>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
  <ns1:getCreativesByStatement>
    <ns1:filterStatement>
      <ns1:query>ORDER BY id DESC LIMIT 1</ns1:query>
    </ns1:filterStatement>
  </ns1:getCreativesByStatement>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
